---
kind: type
id: T:Autodesk.Revit.DB.DistanceMeasuredFrom
source: html/909b774e-1565-7178-9b14-dd5c68a3c2fa.htm
---
# Autodesk.Revit.DB.DistanceMeasuredFrom

Indicates if the distance is measured from the top or bottom of the wall.

## Syntax (C#)
```csharp
public enum DistanceMeasuredFrom
```